__BASE__: [
  '../coco.yaml',
  './hyp.scratch.high.yaml',
]

epochs: 500  # total train epochs
per_batch_size: 16  # 16 * 8 = 128
img_size: 640
iou_thres: 0.7
sync_bn: True
conf_free: True
overflow_still_update: False
opencv_threads_num: 0  # opencv: disable threading optimizations

network:
  model_name: yolov9
  nc: 80  # number of classes
  reg_max: 16

  stride: [8, 16, 32]
  depth_multiple: 1.0  # scales module repeats
  width_multiple: 1.0  # scales convolution channels

  # gelan backbone
  backbone:
    [
      # conv down
    [-1, 1, ConvNormAct, [32, 3, 2]],  # 0-P1/2

      # conv down
    [-1, 1, ConvNormAct, [64, 3, 2]],  # 1-P2/4

      # elan-1 block
    [-1, 1, RepNCSPELAN4, [128, 128, 64, 1]],  # 2

      # avg-conv down
    [-1, 1, AConv, [240]],  # 3-P3/8

      # elan-2 block
    [-1, 1, RepNCSPELAN4, [240, 240, 120, 1]],  # 4

      # avg-conv down
    [-1, 1, AConv, [360]],  # 5-P4/16

      # elan-2 block
    [-1, 1, RepNCSPELAN4, [360, 360, 180, 1]],  # 6

      # avg-conv down
    [-1, 1, AConv, [480]],  # 7-P5/32

      # elan-2 block
    [-1, 1, RepNCSPELAN4, [480, 480, 240, 1]],  # 8
    ]

  # elan head
  head:
    [
      # elan-spp block
    [-1, 1, SPPELAN, [480, 240]],  # 9

      # up-concat merge
    [-1, 1, Upsample, [None, 2, 'nearest']],
    [[-1, 6], 1, Concat, [1]],  # cat backbone P4

      # elan-2 block
    [-1, 1, RepNCSPELAN4, [360, 360, 180, 1]],  # 12

      # up-concat merge
    [-1, 1, Upsample, [None, 2, 'nearest']],
    [[-1, 4], 1, Concat, [1]],  # cat backbone P3

      # elan-2 block
    [-1, 1, RepNCSPELAN4, [240, 240, 120, 1]],  # 15

      # avg-conv-down merge
    [-1, 1, AConv, [180]],
    [[-1, 12], 1, Concat, [1]],  # cat head P4

      # elan-2 block
    [-1, 1, RepNCSPELAN4, [360, 360, 180, 1]],  # 19 (P4/16-medium)

      # avg-conv-down merge
    [-1, 1, AConv, [240]],
    [[-1, 9], 1, Concat, [1]],  # cat head P5

      # elan-2 block
    [-1, 1, RepNCSPELAN4, [480, 240, 240, 1]],  # 22 (P5/32-large)

      # detect
    [[15, 18, 21], 1, YOLOv8Head, [nc, reg_max, stride]],  # Detect(P3, P4, P5)
    ]
